package ru.foxit.grayfox.DZ;

public class Dek {
    /**
     *
     * 3. Создать класс для реализации дека.
     * PushBack — добавление в конец очереди.
     * PushFront — добавление в начало очереди.
     * PopBack — выборка с конца очереди.
     * PopFront — выборка с начала очереди.
     * Проверка наличия элементов.
     * Очистка.
     */

    // FIXME: 21.06.2018 Не реализовал, не понял задание, отписал в телеграмм.
    // FIXME: 21.06.2018 Осталось 20 минут до сдачи, не успею сделать.

}
